In [2]:
import pandas as pd

In [45]:
log = pd.read_csv('log.csv', header=None)

In [3]:
log = pd.read_csv("log.csv")  
log = log.dropna()  
log.columns = ['user_id', 'time', 'bet', 'win']  
log['time'] = log['time'].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time']) 
log['hour'] = log['time'].apply(lambda x: x.hour)  
log

,user_id,time,bet,win,hour
13,Запись пользователя № - user_917,2019-01-02 08:57:36,145732.0,1987653.0,8
28,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0,13
150,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0,21
188,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0,18
204,Запись пользователя № - user_931,2019-01-22 05:26:59,300.0,4319.0,5
...,...,...,...,...,...
966,Запись пользователя № - user_975,2019-04-19 22:25:15,1000.0,6108.0,22
970,Запись пользователя № - user_912,2019-04-20 10:35:49,10554.0,31799.0,10
971,Запись пользователя № - user_926,2019-04-20 10:35:50,10354.0,30244.0,10
975,Запись пользователя № - user_970,2019-04-20 10:35:54,10354.0,30691.0,10
990,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12

Предобработка состоит из следующих этапов:

1. Загрузка.
2. Очистка.
3. Обогащение / feature engineering.
4. Анализ.

1. header = None — загрузить без строки с заголовком,
2. skiprows=n — пропустить n строк,
3. encoding — загрузить в конкретной кодировке,
4. na_values — список значений, который нужно заменить на NaN (специальный объект, обозначающий пропущенное значение).

In [40]:
sample = pd.read_csv('sample.csv')
columns = sample.columns
# columns

sample.columns = ['name', 'city', 'age', 'profession']

In [46]:
log.columns = ['user_id', 'time', 'bet', 'win']

In [38]:
users = pd.read_csv('users.csv',sep = '\t', encoding = 'koi8_r')
users.sample(3)

      Юзверь                   мейл         Гео
51  User_969  Knightstra@icloud.com  Красноярск
99  User_921           Aavast@ya.ru      Ижевск
58  User_922    Lyfernozoi@inbox.ru   Хабаровск

In [39]:
users.columns = ['user_id', 'email', 'geo']
users.sample(3)

     user_id             email          geo
59  User_926  Magazineli@ya.ru          NaN
22  User_998  Decitere@mail.ru       Казань
68  User_937   Paleoso@ukr.net  Арзангелтск

- .unique() - выдает список уникальных значений колонки
- .info() - выдает агрегированную информацию о датасете

In [43]:
sample.name.unique()

array(['Иванов', nan, 'sidorov', '_______', 'Кузнецов', 'Сажин',
       'Котлеревский', 'Завалишина', 'Левина', 'Фикс'], dtype=object)

In [44]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   city        10 non-null     object
 2   age         11 non-null     int64
 3   profession  11 non-null     object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

In [47]:
log.user_id.unique()

array(['Запись пользователя № - user_919',
       'Запись пользователя № - user_973',
       'Запись пользователя № - user_903',
       'Запись пользователя № - user_954',
       'Запись пользователя № - user_917',
       'Запись пользователя № - user_900',
       'Запись пользователя № - user_980',
       'Запись пользователя № - user_906',
       'Запись пользователя № - user_952',
       'Запись пользователя № - user_972',
       'Запись пользователя № - user_966',
       'Запись пользователя № - user_964',
       'Запись пользователя № - user_978',
       'Запись пользователя № - user_968',
       'Запись пользователя № - user_974',
       'Запись пользователя № - user_998',
       'Запись пользователя № - user_990',
       'Запись пользователя № - user_942',
       'Запись пользователя № - user_929',
       'Запись пользователя № - user_976',
       'Запись пользователя № - user_927',
       'Запись пользователя № - user_951',
       'Запись пользователя № - user_949',
       'Запись пользователя № - user_987',
       'Запись пользователя № - user_985',
       'Запись пользователя № - user_992',
       'Запись пользователя № - user_937',
       'Запись пользователя № - user_913',
       'Запись пользователя № - user_948',
       'Запись пользователя № - user_916',
       'Запись пользователя № - user_938',
       'Запись пользователя № - user_997',
       'Запись пользователя № - user_940',
       'Запись пользователя № - user_918',
       'Запись пользователя № - user_960',
       'Запись пользователя № - user_905',
       'Запись пользователя № - user_924',
       'Запись пользователя № - user_958',
       'Запись пользователя № - user_920',
       'Запись пользователя № - user_943',
       'Запись пользователя № - user_935',
       'Запись пользователя № - user_915',
       'Запись пользователя № - user_921',
       'Запись пользователя № - user_999',
       'Запись пользователя № - user_982',
       'Запись пользователя № - user_928',
       'Запись пользователя № - user_944',
       'Запись пользователя № - user_912',
       'Запись пользователя № - user_969',
       'Запись пользователя № - user_901',
       'Запись пользователя № - user_995',
       'Запись пользователя № - user_933',
       'Запись пользователя № - user_986',
       'Запись пользователя № - user_971',
       'Запись пользователя № - user_977',
       'Запись пользователя № - user_979',
       'Запись пользователя № - user_910',
       'Запись пользователя № - user_994',
       'Запись пользователя № - user_907',
       'Запись пользователя № - user_941',
       'Запись пользователя № - user_989',
       'Запись пользователя № - user_955',
       'Запись пользователя № - user_991',
       'Запись пользователя № - user_996',
       'Запись пользователя № - user_926',
       'Запись пользователя № - user_984',
       'Запись пользователя № - user_957',
       'Запись пользователя № - user_914',
       'Запись пользователя № - user_988',
       'Запись пользователя № - user_923',
       'Запись пользователя № - user_967',
       'Запись пользователя № - user_945',
       'Запись пользователя № - user_993',
       'Запись пользователя № - user_908',
       'Запись пользователя № - user_930',
       'Запись пользователя № - user_981',
       'Запись пользователя № - user_936',
       'Запись пользователя № - user_922',
       'Запись пользователя № - user_962',
       'Запись пользователя № - user_965',
       'Запись пользователя № - user_959',
       'Запись пользователя № - user_963',
       'Запись пользователя № - user_904',
       'Запись пользователя № - user_931',
       'Запись пользователя № - user_1000',
       'Запись пользователя № - user_946',
       'Запись пользователя № - user_970',
       'Запись пользователя № - user_939',
       'Запись пользователя № - user_961',
       'Запись пользователя № - user_911',
       'Запись пользователя № - user_950',
       'Запись пользователя № - user_956',
       'Запись пользователя № - user_909',
       'Запись пользователя № - user_983',
       'Запись пользователя № - user_902',
       'Запись пользователя № - user_947',
       'Запись пользователя № - user_975',
       'Запись пользователя № - user_953',
       'Запись пользователя № - user_925',
       'Запись пользователя № - user_934',
       'Запись пользователя № - user_932', '#error'], dtype=object)

In [58]:
sample = pd.read_csv("sample.csv")
# Напишите ваш код ниже
sample2 = sample[(sample['Age'] <=30) & (sample['Profession'] == 'Рабочий')]
sample2

       Name    City  Age Profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [57]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
# Напишите ваш код ниже
log_win = log[log['win'].isna() == False]
win_count = len(log_win.index)
win_count

138

- .query() - фильтрация наподобие sql

In [59]:
sample.query('Age==25')

     Name    City  Age Profession
0  Иванов  Москва   25     Клинер
2  Иванов  Москва   25     Клинер

In [60]:
sample.query('City in ["Рига", "Сочи","Чебоксары", "Сургут"] & 21<Age<50 & Profession!="Менеджер"')

     Name    City  Age Profession
6   Сажин  Сургут   29    Рабочий
10   Фикс    Рига   42    Рабочий

In [62]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
# Напишите ваш код ниже
log2 = log.query('bet < 2000 & win > 0')

- str.match ("abc") — ищет строки, которые начинаются c abc,
- str.contains ("abc") — ищет строки, в которых есть abc.
- Обе функции не могут работать с NaN, необходимо использовать параметр na = False
- В результате применения функции мы получаем своеобразную маску, которую мы можем наложить на датафрейм для фильтрации.

In [63]:
sample[sample.Name.str.match("К", na=False)]

           Name        City  Age Profession
5      Кузнецов        Сочи   19    Рабочий
7  Котлеревский  Йошкар-Ола   32    Рабочий

In [64]:
sample[~sample.Name.str.match("К", na=False)]

          Name         City  Age Profession
0       Иванов       Москва   25     Клинер
1          NaN    Волгоград   31   Менеджер
2       Иванов       Москва   25     Клинер
3      sidorov  Владивосток   43   Менеджер
4      _______        Курск   50   Водитель
6        Сажин       Сургут   29    Рабочий
8   Завалишина    Чебоксары   36   Менеджер
9       Левина          NaN   55    Рабочий
10        Фикс         Рига   42    Рабочий

In [65]:
sample = pd.read_csv("sample.csv")
# Введите ваш код ниже
sample3 = sample[sample.City.str.contains("о", na=False)]
sample3

           Name         City  Age Profession
0        Иванов       Москва   25     Клинер
1           NaN    Волгоград   31   Менеджер
2        Иванов       Москва   25     Клинер
3       sidorov  Владивосток   43   Менеджер
5      Кузнецов         Сочи   19    Рабочий
7  Котлеревский   Йошкар-Ола   32    Рабочий
8    Завалишина    Чебоксары   36   Менеджер

In [66]:
sample = pd.read_csv("sample.csv")
# Введите ваш код ниже
sample4 = sample[~sample.City.str.contains("о", na=False)]
sample4

       Name    City  Age Profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

In [68]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
# Напишите ваш код ниже
new_log =log[~log.user_id.str.contains("#error", na=False)]

Apply вызывает свою функцию для каждого элемента колонки. Функции, с которыми работает apply, бывают двух видов:

- лямбда-функции (можно задать внутри apply),
- обычные именные функции (определяются через def).

In [72]:
sample = pd.read_csv("sample.csv")
# Напишите ваш код ниже
sample['Age'] = sample['Age'].apply(lambda x: x+1)
sample2 = sample

In [76]:
sample = pd.read_csv("sample.csv")
# Напишите ваш код ниже
sample['City'] = sample['City'].apply(lambda x: str(x).lower())
sample2 = sample

In [82]:
sample = pd.read_csv("sample.csv")
#  Напишите ваш код ниже
def profession_code(s):
    if s == 'Рабочий':
        return 0
    elif s == 'Менеджер':
        return 1
    else: 
        return 2

sample['Profession'] = sample['Profession'].apply(lambda x: profession_code(x))
sample2 = sample

In [84]:
def age_category(age):
# Ваш код ниже
    if age < 23:
        return 'молодой'
    elif (age >=23) & (age < 35):
        return 'средний'
    elif age > 35:
        return 'зрелый'

In [86]:
sample = pd.read_csv("sample.csv")
#  Напишите ваш код ниже
def age_category(age):
# Ваш код ниже
    if age < 23:
        return 'молодой'
    elif (age >=23) & (age < 35):
        return 'средний'
    elif age > 35:
        return 'зрелый'
sample['Age_category'] = sample['Age'].apply(lambda x: age_category(x))

In [97]:
log = pd.read_csv('log.csv', header=None)
log.columns = ['user_id','time','bet','win']
# Напишите ваш код ниже
import re

def reg_func(s):
    if re.search(r'user_\d+', s):
        return re.search(r'user_\d+', s).group(0)
    else:
        return ''
    
log['user_id'] = log['user_id'].apply(lambda x:  reg_func(x))
log

      user_id                  time      bet      win
0    user_919  [2019-01-01 14:06:51      NaN      NaN
1    user_973  [2019-01-01 14:51:16      NaN      NaN
2    user_903  [2019-01-01 16:31:16      NaN      NaN
3    user_954  [2019-01-01 17:17:51      NaN      NaN
4    user_954  [2019-01-01 21:31:18      NaN      NaN
..        ...                   ...      ...      ...
995  user_984   [2019-04-20 9:59:58   9754.0      NaN
996                             NaN  10054.0  29265.0
997                             NaN  10454.0      NaN
998                             NaN   1000.0      NaN
999                             NaN  10754.0      NaN

[1000 rows x 4 columns]